MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA206/mcu.h
extern volatile G1W2ADRLBITS G1W2ADRLbits __attribute__((__sfr__));

#define G1W2ADRH G1W2ADRH
extern volatile uint16_t G1W2ADRH __attribute__((__sfr__));
typedef struct tagG1W2ADRHBITS {
  uint16_t W2ADR16:1;
  uint16_t W2ADR17:1;
  uint16_t W2ADR18:1;
  uint16_t W2ADR19:1;
  uint16_t W2ADR20:1;
  uint16_t W2ADR21:1;
  uint16_t W2ADR22:1;
  uint16_t W2ADR23:1;
} G1W2ADRHBITS;
extern volatile G1W2ADRHBITS G1W2ADRHbits __attribute__((__sfr__));

#define G1PUW G1PUW
extern volatile uint16_t G1PUW __attribute__((__sfr__));
__extension__ typedef struct tagG1PUWBITS {
  union {
    struct {
      uint16_t PUW:11;
    };
    struct {
      uint16_t PUW0:1;
      uint16_t PUW1:1;
      uint16_t PUW2:1;
      uint16_t PUW3:1;
      uint16_t PUW4:1;
      uint16_t PUW5:1;
      uint16_t PUW6:1;
      uint16_t PUW7:1;
      uint16_t PUW8:1;
      uint16_t PUW9:1;
      uint16_t PUW10:1;
    };
  };
} G1PUWBITS;
extern volatile G1PUWBITS G1PUWbits __attribute__((__sfr__));

#define G1PUH G1PUH
extern volatile uint16_t G1PUH __attribute__((__sfr__));
__extension__ typedef struct tagG1PUHBITS {
  union {
    struct {
      uint16_t PUH:11;
    };
    struct {
      uint16_t PUH0:1;
      uint16_t PUH1:1;
      uint16_t PUH2:1;
      uint16_t PUH3:1;
      uint16_t PUH4:1;
      uint16_t PUH5:1;
      uint16_t PUH6:1;
      uint16_t PUH7:1;
      uint16_t PUH8:1;
      uint16_t PUH9:1;
      uint16_t PUH10:1;
    };
  };
} G1PUHBITS;
extern volatile G1PUHBITS G1PUHbits __attribute__((__sfr__));

#define G1DPADRL G1DPADRL
extern volatile uint16_t G1DPADRL __attribute__((__sfr__));
typedef struct tagG1DPADRLBITS {
  uint16_t DPADR0:1;
  uint16_t DPADR1:1;
  uint16_t DPADR2:1;
  uint16_t DPADR3:1;
  uint16_t DPADR4:1;
  uint16_t DPADR5:1;
  uint16_t DPADR6:1;
  uint16_t DPADR7:1;
  uint16_t DPADR8:1;
  uint16_t DPADR9:1;
  uint16_t DPADR10:1;
  uint16_t DPADR11:1;
  uint16_t DPADR12:1;
  uint16_t DPADR13:1;
  uint16_t DPADR14:1;
  uint16_t DPADR15:1;
} G1DPADRLBITS;
extern volatile G1DPADRLBITS G1DPADRLbits __attribute__((__sfr__));

#define G1DPADRH G1DPADRH
extern volatile uint16_t G1DPADRH __attribute__((__sfr__));
typedef struct tagG1DPADRHBITS {
  uint16_t DPADR16:1;
  uint16_t DPADR17:1;
  uint16_t DPADR18:1;
  uint16_t DPADR19:1;
  uint16_t DPADR20:1;
  uint16_t DPADR21:1;
  uint16_t DPADR22:1;
  uint16_t DPADR23:1;
} G1DPADRHBITS;
extern volatile G1DPADRHBITS G1DPADRHbits __attribute__((__sfr__));

#define G1DPW G1DPW
extern volatile uint16_t G1DPW __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWBITS {
  union {
    struct {
      uint16_t DPW:11;
    };
    struct {
      uint16_t DPW0:1;
      uint16_t DPW1:1;
      uint16_t DPW2:1;
      uint16_t DPW3:1;
      uint16_t DPW4:1;
      uint16_t DPW5:1;
      uint16_t DPW6:1;
      uint16_t DPW7:1;
      uint16_t DPW8:1;
      uint16_t DPW9:1;
      uint16_t DPW10:1;
    };
  };
} G1DPWBITS;
extern volatile G1DPWBITS G1DPWbits __attribute__((__sfr__));

#define G1DPH G1DPH
extern volatile uint16_t G1DPH __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHBITS {
  union {
    struct {
      uint16_t DPH:11;
    };
    struct {
      uint16_t DPH0:1;
      uint16_t DPH1:1;
      uint16_t DPH2:1;
      uint16_t DPH3:1;
      uint16_t DPH4:1;
      uint16_t DPH5:1;
      uint16_t DPH6:1;
      uint16_t DPH7:1;
      uint16_t DPH8:1;
      uint16_t DPH9:1;
      uint16_t DPH10:1;
    };
  };
} G1DPHBITS;
extern volatile G1DPHBITS G1DPHbits __attribute__((__sfr__));

#define G1DPWT G1DPWT
extern volatile uint16_t G1DPWT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPWTBITS {
  union {
    struct {
      uint16_t DPWT:11;
    };
    struct {
      uint16_t DPWT0:1;
      uint16_t DPWT1:1;
      uint16_t DPWT2:1;
      uint16_t DPWT3:1;
      uint16_t DPWT4:1;
      uint16_t DPWT5:1;
      uint16_t DPWT6:1;
      uint16_t DPWT7:1;
      uint16_t DPWT8:1;
      uint16_t DPWT9:1;
      uint16_t DPWT10:1;
    };
  };
} G1DPWTBITS;
extern volatile G1DPWTBITS G1DPWTbits __attribute__((__sfr__));

#define G1DPHT G1DPHT
extern volatile uint16_t G1DPHT __attribute__((__sfr__));
__extension__ typedef struct tagG1DPHTBITS {
  union {
    struct {
      uint16_t DPHT:11;
    };
    struct {
      uint16_t DPHT0:1;
      uint16_t DPHT1:1;
      uint16_t DPHT2:1;
      uint16_t DPHT3:1;
      uint16_t DPHT4:1;
      uint16_t DPHT5:1;
      uint16_t DPHT6:1;
      uint16_t DPHT7:1;
      uint16_t DPHT8:1;
      uint16_t DPHT9:1;
      uint16_t DPHT10:1;
    };
  };
} G1DPHTBITS;
extern volatile G1DPHTBITS G1DPHTbits __attribute__((__sfr__));

#define G1CON2 G1CON2
extern volatile uint16_t G1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagG1CON2BITS {
  union {
    struct {
      uint16_t DPMODE:3;
      uint16_t :2;
      uint16_t DPBPP:3;
      uint16_t DPTEST:2;
      uint16_t :2;
      uint16_t DPSTGER:2;
      uint16_t DPGWDTH:2;
    };
    struct {
      uint16_t DPMODE0:1;
      uint16_t DPMODE1:1;
      uint16_t DPMODE2:1;
      uint16_t :2;
      uint16_t DPBPP0:1;
      uint16_t DPBPP1:1;
      uint16_t DPBPP2:1;
      uint16_t DPTEST0:1;
      uint16_t DPTEST1:1;
      uint16_t :2;
      uint16_t DPSTGER0:1;
      uint16_t DPSTGER1:1;
      uint16_t DPGWDTH0:1;
      uint16_t DPGWDTH1:1;
    };
  };
} G1CON2BITS;
extern volatile G1CON2BITS G1CON2bits __attribute__((__sfr__));

#define G1CON3 G1CON3
extern volatile uint16_t G1CON3 __attribute__((__sfr__));
typedef struct tagG1CON3BITS {
  uint16_t DPHSOE:1;
  uint16_t DPVSOE:1;
  uint16_t DPENOE:1;
  uint16_t DPPWROE:1;
  uint16_t DPHSPOL:1;
  uint16_t DPVSPOL:1;
  uint16_t DPENPOL:1;
  uint16_t DPCLKPOL:1;
  uint16_t DPPOWER:1;
  uint16_t DPPINOE:1;
} G1CON3BITS;
extern volatile G1CON3BITS G1CON3bits __attribute__((__sfr__));

#define G1ACTDA G1ACTDA
extern volatile uint16_t G1ACTDA __attribute__((__sfr__));
__extension__ typedef struct tagG1ACTDABITS {
  union {
    struct {
      uint16_t ACTPIX:8;
      uint16_t ACTLINE:8;
    };
    struct {
      uint16_t ACTPIX0:1;
      uint16_t ACTPIX1:1;
      uint16_t ACTPIX2:1;
      uint16_t ACTPIX3:1;
      uint16_t ACTPIX4:1;
      uint16_t ACTPIX5:1;
      uint16_t ACTPIX6:1;
      uint16_t ACTPIX7:1;
      uint16_t ACTLINE0:1;
      uint16_t ACTLINE1:1;
      uint16_t ACTLINE2:1;
      uint16_t ACTLINE3:1;
      uint16_t ACTLINE4:1;
      uint16_t ACTLINE5:1;
      uint16_t ACTLINE6:1;
      uint16_t ACTLINE7:1;
    };
  };
} G1ACTDABITS;
extern volatile G1ACTDABITS G1ACTDAbits __attribute__((__sfr__));

#define G1HSYNC G1HSYNC
extern volatile uint16_t G1HSYNC __attribute__((__sfr__));
__extension__ typedef struct tagG1HSYNCBITS {
  union {
    struct {
      uint16_t HSST:8;
      uint16_t HSLEN:8;
    };
    struct {
      uint16_t HSST0:1;
      uint16_t HSST1:1;
      uint16_t HSST2:1;
      uint16_t HSST3:1;
      uint16_t HSST4:1;
      uint16_t HSST5:1;
      uint16_t HSST6:1;
      uint16_t HSST7:1;
      uint16_t HSLEN0:1;
      uint16_t HSLEN1:1;
      uint16_t HSLEN2:1;
      uint16_t HSLEN3:1;
      uint16_t HSLEN4:1;
      uint16_t HSLEN5:1;
      uint16_t HSLEN6:1;
      uint16_t HSLEN7:1;
    };
  };
} G1HSYNCBITS;
