MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128DA206/mcu.h
#define _G1W2ADRL_W2ADR8_POSITION                0x00000008
#define _G1W2ADRL_W2ADR8_MASK                    0x00000100
#define _G1W2ADRL_W2ADR8_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR9_POSITION                0x00000009
#define _G1W2ADRL_W2ADR9_MASK                    0x00000200
#define _G1W2ADRL_W2ADR9_LENGTH                  0x00000001

#define _G1W2ADRL_W2ADR10_POSITION               0x0000000A
#define _G1W2ADRL_W2ADR10_MASK                   0x00000400
#define _G1W2ADRL_W2ADR10_LENGTH                 0x00000001

#define _G1W2ADRL_W2ADR11_POSITION               0x0000000B
#define _G1W2ADRL_W2ADR11_MASK                   0x00000800
#define _G1W2ADRL_W2ADR11_LENGTH                 0x00000001

#define _G1W2ADRL_W2ADR12_POSITION               0x0000000C
#define _G1W2ADRL_W2ADR12_MASK                   0x00001000
#define _G1W2ADRL_W2ADR12_LENGTH                 0x00000001

#define _G1W2ADRL_W2ADR13_POSITION               0x0000000D
#define _G1W2ADRL_W2ADR13_MASK                   0x00002000
#define _G1W2ADRL_W2ADR13_LENGTH                 0x00000001

#define _G1W2ADRL_W2ADR14_POSITION               0x0000000E
#define _G1W2ADRL_W2ADR14_MASK                   0x00004000
#define _G1W2ADRL_W2ADR14_LENGTH                 0x00000001

#define _G1W2ADRL_W2ADR15_POSITION               0x0000000F
#define _G1W2ADRL_W2ADR15_MASK                   0x00008000
#define _G1W2ADRL_W2ADR15_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR16_POSITION               0x00000000
#define _G1W2ADRH_W2ADR16_MASK                   0x00000001
#define _G1W2ADRH_W2ADR16_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR17_POSITION               0x00000001
#define _G1W2ADRH_W2ADR17_MASK                   0x00000002
#define _G1W2ADRH_W2ADR17_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR18_POSITION               0x00000002
#define _G1W2ADRH_W2ADR18_MASK                   0x00000004
#define _G1W2ADRH_W2ADR18_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR19_POSITION               0x00000003
#define _G1W2ADRH_W2ADR19_MASK                   0x00000008
#define _G1W2ADRH_W2ADR19_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR20_POSITION               0x00000004
#define _G1W2ADRH_W2ADR20_MASK                   0x00000010
#define _G1W2ADRH_W2ADR20_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR21_POSITION               0x00000005
#define _G1W2ADRH_W2ADR21_MASK                   0x00000020
#define _G1W2ADRH_W2ADR21_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR22_POSITION               0x00000006
#define _G1W2ADRH_W2ADR22_MASK                   0x00000040
#define _G1W2ADRH_W2ADR22_LENGTH                 0x00000001

#define _G1W2ADRH_W2ADR23_POSITION               0x00000007
#define _G1W2ADRH_W2ADR23_MASK                   0x00000080
#define _G1W2ADRH_W2ADR23_LENGTH                 0x00000001

#define _G1PUW_PUW_POSITION                      0x00000000
#define _G1PUW_PUW_MASK                          0x000007FF
#define _G1PUW_PUW_LENGTH                        0x0000000B

#define _G1PUW_PUW0_POSITION                     0x00000000
#define _G1PUW_PUW0_MASK                         0x00000001
#define _G1PUW_PUW0_LENGTH                       0x00000001

#define _G1PUW_PUW1_POSITION                     0x00000001
#define _G1PUW_PUW1_MASK                         0x00000002
#define _G1PUW_PUW1_LENGTH                       0x00000001

#define _G1PUW_PUW2_POSITION                     0x00000002
#define _G1PUW_PUW2_MASK                         0x00000004
#define _G1PUW_PUW2_LENGTH                       0x00000001

#define _G1PUW_PUW3_POSITION                     0x00000003
#define _G1PUW_PUW3_MASK                         0x00000008
#define _G1PUW_PUW3_LENGTH                       0x00000001

#define _G1PUW_PUW4_POSITION                     0x00000004
#define _G1PUW_PUW4_MASK                         0x00000010
#define _G1PUW_PUW4_LENGTH                       0x00000001

#define _G1PUW_PUW5_POSITION                     0x00000005
#define _G1PUW_PUW5_MASK                         0x00000020
#define _G1PUW_PUW5_LENGTH                       0x00000001

#define _G1PUW_PUW6_POSITION                     0x00000006
#define _G1PUW_PUW6_MASK                         0x00000040
#define _G1PUW_PUW6_LENGTH                       0x00000001

#define _G1PUW_PUW7_POSITION                     0x00000007
#define _G1PUW_PUW7_MASK                         0x00000080
#define _G1PUW_PUW7_LENGTH                       0x00000001

#define _G1PUW_PUW8_POSITION                     0x00000008
#define _G1PUW_PUW8_MASK                         0x00000100
#define _G1PUW_PUW8_LENGTH                       0x00000001

#define _G1PUW_PUW9_POSITION                     0x00000009
#define _G1PUW_PUW9_MASK                         0x00000200
#define _G1PUW_PUW9_LENGTH                       0x00000001

#define _G1PUW_PUW10_POSITION                    0x0000000A
#define _G1PUW_PUW10_MASK                        0x00000400
#define _G1PUW_PUW10_LENGTH                      0x00000001

#define _G1PUH_PUH_POSITION                      0x00000000
#define _G1PUH_PUH_MASK                          0x000007FF
#define _G1PUH_PUH_LENGTH                        0x0000000B

#define _G1PUH_PUH0_POSITION                     0x00000000
#define _G1PUH_PUH0_MASK                         0x00000001
#define _G1PUH_PUH0_LENGTH                       0x00000001

#define _G1PUH_PUH1_POSITION                     0x00000001
#define _G1PUH_PUH1_MASK                         0x00000002
#define _G1PUH_PUH1_LENGTH                       0x00000001

#define _G1PUH_PUH2_POSITION                     0x00000002
#define _G1PUH_PUH2_MASK                         0x00000004
#define _G1PUH_PUH2_LENGTH                       0x00000001

#define _G1PUH_PUH3_POSITION                     0x00000003
#define _G1PUH_PUH3_MASK                         0x00000008
#define _G1PUH_PUH3_LENGTH                       0x00000001

#define _G1PUH_PUH4_POSITION                     0x00000004
#define _G1PUH_PUH4_MASK                         0x00000010
#define _G1PUH_PUH4_LENGTH                       0x00000001

#define _G1PUH_PUH5_POSITION                     0x00000005
#define _G1PUH_PUH5_MASK                         0x00000020
#define _G1PUH_PUH5_LENGTH                       0x00000001

#define _G1PUH_PUH6_POSITION                     0x00000006
#define _G1PUH_PUH6_MASK                         0x00000040
#define _G1PUH_PUH6_LENGTH                       0x00000001

#define _G1PUH_PUH7_POSITION                     0x00000007
#define _G1PUH_PUH7_MASK                         0x00000080
#define _G1PUH_PUH7_LENGTH                       0x00000001

